"use server";

import { Container } from '@mantine/core'
import React from 'react'
import Markdown from '../components/Section/components/Markdown'

const content = (`
# ขั้นตอนแจ้งความคดีออนไลน์
## แจ้งความคดีออนไลน์กรณี Walk in ไปยังสถานีตำรวจด้วยตัวเอง
1. เจ้าทุกข์เดินทางไปแจ้งความคดีออนไลน์ทุกประเภทที่สถานีตำรวจใกล้บ้าน
1. พนักงานสอบสวนรับดำเนินการ
    - รับคำร้องทุกข์
    - สอบถามเจ้าทุกข์ว่าได้แจ้งธนาคารให้อายัดบัญชีแล้วหรือไม่
      - กรณีเจ้าทุกข์แจ้งธนาคารแล้วและเดินทางมาสถานีตำรวจภายใน 72 ชม. พนักงานสอบสวนจะรับคำร้องทุกข์และแจ้งธนาคาร (ผ่านระบบระหว่างตำรวจ-ธนาคาร) และดำเนินการเกี่ยวกับบัญชีดังกล่าวภายใน 7 วัน
      - กรณีเจ้าทุกข์แจ้งธนาคารแล้ว แต่เดินทางมาสถานีตำรวจเกิน 72 ชม. พนักงานสอบสวนแจ้งว่าธนาคารอาจยกเลิกการอายัดบัญชีนั้น 
      - กรณียังไม่ได้แจ้งธนาคาร ให้เจ้าทุกข์รีบโทรแจ้งธนาคารก่อน จากนั้นพนักงานสอบสวนจึงดำเนินการต่อได้ภายใน 7 วัน
1. พนักงานสอบสวนบันทึกปากคำเจ้าทุกข์
1. พนักงานสอบสวนลงข้อมูลในระบบรับแจ้งความเพื่อออกเลข Case ID (ไม่ใช่เอกสารแจ้งความ หรือ บันทึกประจำวันอิเล็กทรอนิกส์)
1. พนักงานสอบสวนออกเอกสาร ลงลายมือชื่อผู้รับแจ้งความ มอบให้เจ้าทุกข์เป็นหลักฐานการรับคำร้อง
1. พนักงานสอบสวนแจ้งธนาคารเพื่ออายัดบัญชีที่รับแจ้งไว้ผ่านระบบของตำรวจ-ธนาคาร 
1. พิจารณาดำเนินการอายัดบัญชี
1. พิจารณาลักษณะคดี*

## แจ้งความคดีออนไลน์กรณีออนไลน์และเลือกสถานีตำรวจ
1. เจ้าทุกข์ โทรสายด่วน 1441 หรือเว็บไซต์ www.thaipoliceonline.go.th หรือ www.thaipoliceonline.com  (2 เว็บไซต์นี้ได้รับการยืนยันจากเจ้าหน้าที่ตำรวจแล้ว) แจ้งความคดีออนไลน์ และเลือกหน่วยงานที่ต้องการไปพบพนักงานสอบสวนซึ่งมี 3 แห่ง ได้แก่  
    - สถานีตำรวจ (สน. หรือ สภ.)
    - กองบัญชาการตำรวจสืบสวนสอบสวนอาชญากรรมทางเทคโนโลยี (บช.สอท.)
    - กองบัญชาการตำรวจสอบสวนกลาง (บก.ปอท.)
แต่การจะเลือกได้นั้น ต้องรู้ก่อนว่าความเสียหายที่เกิดขึ้น เป็นลักษณะคดีออนไลน์ประเภทใด*
1. เจ้าทุกข์โทรแจ้งธนาคารเพื่ออายัดบัญชี และ "รอ" การนัดหมายจากพนักงานสอบสวน
1. "แอดมินตำรวจ" (มีตำแหน่งนี้อยู่จริง) ตรวจสอบข้อมูลในระบบตลอด 24 ชม. เมื่อมีคดีในระบบต้องพิจารณาว่าเป็นคดี 1 ใน 14 คดีออนไลน์ตาม พ.ร.ก. หรือไม่ (ขั้นตอนของเจ้าพนักงาน) 
1. ผู้บริหารคดีที่สถานีตำรวจ แยกประเภทคดีเพื่อส่งต่อไปยังหน่วยที่รับผิดชอบ (ขั้นตอนของเจ้าพนักงาน) 
1. พนักงานสอบสวนดำเนินการทันที (ผ่านทางโทรศัพท์) ดังนี้
    กรณีเจ้าทุกข์ แจ้งอายัดบัญชีธนาคารเรียบร้อยแล้ว และข้อมูลในระบบที่แจ้ง 1441 หรือเว็บไซต์ ครบถ้วน พนักงานสอบสวนจะแจ้งไปยังธนาคารผ่านระบบของตำรวจ-ธนาคาร ถึงการร้องทุกข์ (ว่าเป็นความจริง ไม่ได้แจ้งความเท็จ) 
    กรณีเจ้าทุกข์ แจ้งอายัดบัญชีธนาคารเรียบร้อยแล้ว และข้อมูลในระบบที่แจ้ง 1441 หรือเว็บไซต์ ไม่ครบถ้วน พนักงานสอบสวนจะแจ้งเจ้าทุกข์ให้เพิ่มเอกสารที่ขาดไปก่อน แล้วจึงแจ้งธนาคารให้อีกครั้ง
    กรณีเจ้าทุกข์ ไม่ได้แจ้งอายัดบัญชีธนาคาร พนักงานสอบสวนจะบอกให้เจ้าทุกข์รีบแจ้งไปยังธนาคารก่อน จากนั้นพนักงานสอบสวนจึงดำเนินการตามขั้นตอนต่อไป
1. นัดหมายเจ้าทุกข์มาบันทึกปากคำภายใน 7 วัน
1. พนักงานสอบสวนลงข้อมูลในระบบรับแจ้งความเพื่อออกเลข Case ID (ไม่ใช่เอกสารแจ้งความ หรือ บันทึกประจำวันอิเล็กทรอนิกส์)
1. พนักงานสอบสวนออกเอกสาร ลงลายมือชื่อผู้รับแจ้งความ มอบให้เจ้าทุกข์เป็นหลักฐานการรับคำร้อง
1. พนักงานสอบสวนแจ้งธนาคารเพื่ออายัดบัญชีที่รับแจ้งไว้ผ่านระบบของตำรวจ-ธนาคาร
1. พิจารณาดำเนินการอายัดบัญชี
1. พิจารณาลักษณะคดี*

## พิจารณาคดีเพื่อส่งเรื่องไปยังหน่วยงานที่รับผิดชอบโดยตรง
"อาชญากรรมทางเทคโนโลยี" นั้นมีหลากหลายประเภท แต่ที่กำหนดไว้ตาม พ.ร.ก.มาตรการป้องกันและปราบปรามอาชญากรรมทางเทคโนโลยี พ.ศ.2566 กำหนดไว้ทั้งหมด 14 ประเภทเท่านั้น และมีการแบ่งแยกหน่วยงานที่รับผิดชอบตามจุดประสงค์การก่อตั้งหน่วยต่าง ๆ ขึ้นมา
#
สำหรับสิ่งที่ประชาชนควรรู้ไว้คือ เมื่อความเสียหายเกี่ยวกับภัยออนไลน์เกิดขึ้นแล้วนั้น ต้องรู้ว่าคดีของตนเองอยู่ในประเภทใด เพื่อที่จะตามคดี หรือ ไปตามนัดสืบสวน-สอบสวน ได้ทันท่วงทียิ่งขึ้น 

`);

const ReportPage = () => {
  return (
    <Container>
      <Markdown children={content} />
    </Container>
  )
}

export default ReportPage