import categories, { Category } from "./category";

export type LiableName       = "imprisonment" | "fine" | "fineUntil";
export type LiableType       = "<=" | "-";
export type LiableValue      = [LiableName | number, LiableType | string, number];
export type LiableSingle     = Record<LiableName, LiableValue>;
export type LiableMultiple   = LiableSingle[];
export type Liable           = LiableMultiple | LiableSingle;

export interface Section{
  id: number;
  text: string;
  offense?: string;
  liable?: Liable;
  liablePoint: number;
  cases?: string[]
  category?: Category;
}

const WAGE = 400;

const calculateLiablePoint = (liable: Liable) => {
  try {
    let point = 0;
  
    const calPoint = (liable : LiableSingle) => {
      if (liable?.fine) point = (liable.fine[2] != undefined ? liable.fine[0] : liable.fine[1]) as number;
      if (liable?.imprisonment) point = ((liable.imprisonment[2] != undefined ? liable.imprisonment[0] : liable.imprisonment[1]) as number) * WAGE;
    }

    if (Array.isArray(liable)) {
      liable.forEach((liableSingle) => calPoint(liableSingle));
    } else {
      calPoint(liable);
    }

    return point / 100;
  } catch (error) {
    console.error(error);
    return 0;
  }
}

export default [
  {
    "id": 1,
    "text": `พระราชบัญญัตินี้เรียกว่า **“พระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. ๒๕๕๐”**`
  },
  {
    "id": 2,
    "text": `พระราชบัญญัตินี้ให้ใช้บังคับเมื่อพ้นกำหนดสามสิบวันนับแต่ วันประกาศในราชกิจจานุเบกษาเป็นต้นไป`
  },
  {
    "id": 3,
    "text": `ในพระราชบัญญัตินี้
    
  **“ระบบคอมพิวเตอร์”** หมายความว่า อุปกรณ์หรือชุดอุปกรณ์ของคอมพิวเตอร์ ที่เชื่อมการทำงานเข้าด้วยกัน โดยได้มีการกำหนดคำสั่ง ชุดคำสั่ง หรือสิ่งอื่นใด และแนวทางปฏิบัติงานให้อุปกรณ์หรือชุดอุปกรณ์ทำหน้าที่ประมวลผลข้อมูลโดย อัตโนมัติ

  **“ข้อมูลคอมพิวเตอร์”** หมายความว่า ข้อมูล ข้อความ คำสั่ง ชุดคำสั่ง หรือสิ่งอื่นใด บรรดาที่อยู่ในระบบคอมพิวเตอร์ในสภาพที่ระบบคอมพิวเตอร์อาจประมวลผลได้ และให้หมายความรวมถึงข้อมูลอิเล็กทรอนิกส์ตามกฎหมายว่าด้วยธุรกรรมทาง อิเล็กทรอนิกส์ด้วย

  **“ข้อมูลจราจรทางคอมพิวเตอร์”** หมายความว่า ข้อมูลเกี่ยวกับการติดต่อสื่อสารของระบบคอมพิวเตอร์ ซึ่งแสดงถึงแหล่งกำเนิด ต้นทาง ปลายทาง เส้นทาง เวลา วันที่ ปริมาณ ระยะเวลา ชนิดของบริการ หรืออื่นๆ ที่เกี่ยวข้องกับการติดต่อสื่อสารของระบบคอมพิวเตอร์นั้น

  **“ผู้ให้บริการ”** หมายความว่า

  1. ผู้ให้บริการแก่บุคคลอื่นในการเข้าสู่อินเทอร์เน็ต หรือให้สามารถติดต่อถึงกันโดยประการอื่น โดยผ่านทางระบบคอมพิวเตอร์ ทั้งนี้ ไม่ว่าจะเป็นการให้บริการในนามของตนเอง หรือในนามหรือเพื่อประโยชน์ของบุคคลอื่น

  2. ผู้ให้บริการเก็บรักษาข้อมูลคอมพิวเตอร์เพื่อประโยชน์ของบุคคลอื่น

  **“ผู้ใช้บริการ”** หมายความว่า ผู้ใช้บริการของผู้ให้บริการไม่ว่าต้องเสียค่าใช้บริการหรือไม่ก็ตาม

  **“พนักงานเจ้าหน้าที่”** หมายความว่า ผู้ซึ่งรัฐมนตรีแต่งตั้งให้ปฏิบัติการตามพระราชบัญญัตินี้

  **“รัฐมนตรี”** หมายความว่า รัฐมนตรีผู้รักษาการตามพระราชบัญญัตินี้
  `
  },
  {
    "id": 4,
    "text": `ให้รัฐมนตรีว่าการกระทรวงเทคโนโลยีสารสนเทศและการสื่อสาร รักษาการตามพระราชบัญญัตินี้ และให้มีอำนาจออกกฎกระทรวงเพื่อปฏิบัติการตามพระราชบัญญัตินี้
กฎกระทรวงนั้น เมื่อได้ประกาศในราชกิจจานุเบกษาแล้วให้ใช้บังคับได้`
  },
  {
    "id": 5,
    "category": 1,
    "offense": `
- **การหลอกลวงผ่านเว็บไซต์ค้าขายสินค้าออนไลน์**: การเปิดเว็บไซต์ที่อ้างว่าเป็นร้านค้าออนไลน์ เพื่อขายสินค้า เช่น โทรศัพท์มือถือ หรือเครื่องใช้ไฟฟ้าที่ไม่มีอยู่จริง โดยใช้เทคนิคต่างๆ เช่น การแสดงภาพสินค้าผ่านเว็บไซต์แล้วหลอกให้ผู้ซื้อทำการโอนเงินล่วงหน้า โดยไม่ส่งสินค้าให้กับผู้ซื้อแต่อย่างใด
- **การขายสินค้าออนไลน์ที่ไม่ได้มาตรฐานหรือผิดกฎหมาย**: การขายสินค้าผ่านช่องทางออนไลน์ เช่น การขายยาปลอม หรือสินค้าที่ไม่ผ่านการรับรองจากหน่วยงานที่เกี่ยวข้อง โดยผู้ขายไม่ได้ระบุข้อมูลที่แท้จริงเกี่ยวกับสินค้าหรือบริการนั้น
- **การแอบอ้างข้อมูลเพื่อทำธุรกรรมการเงิน**: การเปิดเว็บไซต์เพื่อให้บริการต่างๆ เช่น การสมัครสมาชิกหรือลงทะเบียนในเว็บไซต์ของธนาคารออนไลน์ แต่เว็บไซต์ดังกล่าวเป็นเว็บไซต์ปลอมที่สร้างขึ้นมาเพื่อเก็บข้อมูลบัตรเครดิตและข้อมูลส่วนบุคคลของผู้ใช้ โดยมีเจตนาหลอกลวงเพื่อขโมยข้อมูลไปใช้ในทางที่ผิด
- **การเผยแพร่ข้อมูลเท็จที่เกี่ยวกับการซื้อขาย**: การโปรโมตสินค้าออนไลน์หรือบริการที่ไม่มีจริง หรือข้อมูลที่ทำให้ผู้บริโภคหลงเชื่อในคุณภาพสินค้าหรือบริการที่ไม่ตรงตามข้อเท็จจริง เช่น โฆษณาเกินจริงเกี่ยวกับคุณสมบัติของสินค้าออนไลน์
- **การขโมยข้อมูลลูกค้าเพื่อใช้ในการกระทำความผิดทางการค้า**: การแฮกเข้าไปในระบบของเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ เพื่อขโมยข้อมูลบัตรเครดิตของลูกค้า และนำข้อมูลไปใช้ในการทำธุรกรรมผิดกฎหมาย เช่น การซื้อสินค้าออนไลน์โดยใช้ข้อมูลบัตรเครดิตที่ขโมยมา
    `,
    "text": "ผู้ใดเข้าถึงโดยมิชอบซึ่งระบบคอมพิวเตอร์ที่มีมาตรการป้องกัน การเข้าถึงโดยเฉพาะและมาตรการนั้นมิได้มีไว้สำหรับตน ต้องระวางโทษจำคุกไม่เกินหกเดือน หรือปรับไม่เกินหนึ่งหมื่นบาท หรือทั้งจำทั้งปรับ",
    "cases": [
      '8U8uFHUn8JU',
    ],
    "liable": {
      "imprisonment": ["<=", 6 * 30],
      "fine": ["<=", 1 * 10000],
    }
  },
  {
    "id": 6,
    "category": 1,
    "offense": `
- **การแฮกเข้าสู่ระบบพาณิชย์อิเล็กทรอนิกส์เพื่อขโมยข้อมูลบัตรเครดิต**: ผู้ไม่ประสงค์ดีใช้เทคนิคการแฮก (hack) เข้าไปในระบบของเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ เช่น เว็บไซต์ร้านค้าออนไลน์ หรือบริการที่เก็บข้อมูลบัตรเครดิตของลูกค้า เพื่อนำข้อมูลบัตรเครดิตของลูกค้าไปใช้ในการทำธุรกรรมที่ผิดกฎหมาย
- **การปลอมแปลงข้อมูลในระบบเพื่อหลอกลวงลูกค้า**: ผู้กระทำผิดเข้าถึงระบบคอมพิวเตอร์ของบริษัทหรือเว็บไซต์พาณิชย์อิเล็กทรอนิกส์และทำการเปลี่ยนแปลงข้อมูลสินค้า เช่น การปรับราคาสินค้าในเว็บไซต์ให้ต่ำลง หรือการหลอกลวงลูกค้าเกี่ยวกับสถานะของสินค้าคงคลัง (เช่น การแสดงสินค้าหมดสต็อกว่า "มีสินค้า" เพื่อหลอกให้ลูกค้าทำการสั่งซื้อ)
    `,
    "text": "ผู้ใดล่วงรู้มาตรการป้องกันการเข้าถึงระบบคอมพิวเตอร์ที่ผู้อื่นจัดทำขึ้น เป็นการเฉพาะ ถ้านำมาตรการดังกล่าวไปเปิดเผยโดยมิชอบในประการที่น่าจะเกิดความเสียหายแก่ ผู้อื่น ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ",
    "liable": {
      "imprisonment": ["<=", 365],
      "fine": ["<=", 2 * 10000],
    }
  },
  {
    "id": 7,
    "category": 1,
    "offense": `
- **การเข้าถึงระบบคอมพิวเตอร์ของผู้ประกอบการพาณิชย์อิเล็กทรอนิกส์โดยไม่ได้รับอนุญาต**: ผู้กระทำผิดแฮกเข้าสู่ระบบคอมพิวเตอร์ของร้านค้าออนไลน์เพื่อขโมยข้อมูลลูกค้า เช่น ข้อมูลบัตรเครดิต ข้อมูลส่วนบุคคล หรือแม้แต่การแก้ไขข้อมูลราคาสินค้าในเว็บไซต์เพื่อประโยชน์ส่วนตัว
- **การใช้ช่องโหว่ในระบบคอมพิวเตอร์ของธุรกิจพาณิชย์อิเล็กทรอนิกส์**: การใช้ช่องโหว่ในซอฟต์แวร์ของเว็บไซต์หรือแอปพลิเคชันการค้าออนไลน์เพื่อแทรกแซงระบบ หรือทำให้เกิดความเสียหายต่อข้อมูล เช่น การเปลี่ยนแปลงข้อมูลสินค้าให้เป็นเท็จ หรือการลบข้อมูลธุรกรรมที่สำคัญ
- **การขโมยข้อมูลการชำระเงินจากระบบออนไลน์**: การใช้เทคนิคฟิชชิง (Phishing) เพื่อหลอกลวงให้ผู้ใช้งานกรอกข้อมูลบัตรเครดิตหรือข้อมูลการเงินอื่นๆ ผ่านเว็บไซต์ปลอม
    `,
    "text": "ผู้ใดเข้าถึงโดยมิชอบซึ่งข้อมูลคอมพิวเตอร์ที่มีมาตรการป้องกันการเข้าถึง โดยเฉพาะและมาตรการนั้นมิได้มีไว้สำหรับตน ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกิน สี่หมื่นบาท หรือทั้งจำทั้งปรับ",
    "liable": {
      "imprisonment": ["<=", 365 * 2],
      "fine": ["<=", 4 * 10000],
    }
  },
  {
    "id": 8,
    "category": 1,
    "offense": `
- **การเผยแพร่ข้อมูลเท็จเพื่อการค้า:** การโฆษณาสินค้าออนไลน์ที่ไม่ตรงกับความจริง เช่น การขายสินค้าที่ไม่ได้มีอยู่จริง แต่ผู้ขายโฆษณาให้ลูกค้าหลงเชื่อ หรือการใช้ข้อมูลเท็จในการทำการตลาดเพื่อดึงดูดลูกค้า เช่น การแสดงรีวิวปลอมของสินค้าบนเว็บไซต์
- **การทำธุรกรรมโดยใช้ข้อมูลส่วนบุคคลที่ขโมยมา:** การใช้ข้อมูลบัตรเครดิตหรือข้อมูลส่วนบุคคลของผู้อื่นโดยไม่ได้รับอนุญาตในการทำธุรกรรมการค้าผ่านระบบออนไลน์ เช่น การซื้อสินค้าหรือบริการผ่านเว็บไซต์ที่ใช้ข้อมูลปลอมเพื่อหลอกลวงผู้ให้บริการ
- **การขายสินค้าที่ละเมิดลิขสิทธิ์:** การขายซอฟต์แวร์ เพลง หรือภาพยนตร์ที่ละเมิดลิขสิทธิ์ผ่านแพลตฟอร์มออนไลน์ เช่น การขายไฟล์ซอฟต์แวร์เถื่อนหรือเพลงที่ไม่ได้รับอนุญาตจากเจ้าของลิขสิทธิ์
- **การดำเนินการในระบบคอมพิวเตอร์ที่หลอกลวง:** การสร้างเว็บไซต์หรือแอปพลิเคชันที่หลอกลวงผู้บริโภค โดยแอบอ้างเป็นบริษัทที่มีชื่อเสียงเพื่อให้ลูกค้าโอนเงินหรือสมัครสมาชิก เช่น การสร้างเว็บไซต์ขายสินค้าที่เหมือนกับเว็บไซต์ของแบรนด์ดังเพื่อหลอกให้ผู้บริโภคซื้อสินค้า
    `,
    "text": ` ผู้ใดกระทำด้วยประการใดโดยมิชอบด้วยวิธีการทางอิเล็กทรอนิกส์&nbsp;  
เพื่อ ดักรับไว้ซึ่งข้อมูลคอมพิวเตอร์ของผู้อื่นที่อยู่ระหว่างการส่งในระบบ คอมพิวเตอร์ และข้อมูลคอมพิวเตอร์นั้นมิได้มีไว้เพื่อประโยชน์สาธารณะหรือเพื่อให้บุคคล ทั่วไปใช้ประโยชน์ได้ ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ`,
    "liable": {
      "imprisonment": ["<=", 365 * 3],
      "fine": ["<=", 6 * 10000],
    }
  },
  {
    "id": 9,
    "category": 1,
    "offense": `
- **การเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต**: การแฮกเข้าสู่ระบบเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ เช่น เว็บไซต์ขายสินค้าออนไลน์ เพื่อขโมยข้อมูลลูกค้า เช่น ข้อมูลบัตรเครดิต หรือข้อมูลส่วนบุคคล
- **การโจมตีระบบคอมพิวเตอร์ด้วยการกระทำที่ทำให้ระบบหยุดทำงาน**: การทำการโจมตีแบบ DDoS (Distributed Denial of Service) โดยส่งคำขอจำนวนมากไปยังเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ ทำให้เว็บไซต์หยุดทำงาน และไม่สามารถให้บริการลูกค้าได้
- **การนำข้อมูลคอมพิวเตอร์ที่ขโมยมาจากระบบของผู้อื่น**: การขโมยฐานข้อมูลลูกค้าจากระบบเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ เช่น ข้อมูลการสั่งซื้อสินค้าหรือข้อมูลการชำระเงินของลูกค้า เพื่อใช้ประโยชน์ในทางที่ผิด เช่น ขายข้อมูลนั้นให้กับบุคคลภายนอก
- **การนำข้อมูลส่วนบุคคลของผู้อื่นมาใช้ในการทำธุรกรรมออนไลน์โดยไม่ได้รับอนุญาต**: การใช้ข้อมูลส่วนตัวของลูกค้าที่ได้รับจากการเข้าถึงระบบอย่างผิดกฎหมาย เพื่อทำการซื้อขายสินค้าออนไลน์ในนามของลูกค้าโดยไม่ขออนุญาต
- **การเผยแพร่ข้อมูลเท็จที่กระทบต่อธุรกิจออนไลน์**: การปล่อยข่าวลือหรือข้อมูลเท็จเกี่ยวกับผลิตภัณฑ์หรือบริการของเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ เพื่อทำให้ลูกค้าหลงเชื่อและหลีกเลี่ยงการซื้อสินค้าจากเว็บไซต์นั้น
    `,
    "text": `ผู้ใดทำให้เสียหาย ทำลาย แก้ไข เปลี่ยนแปลง หรือเพิ่มเติมไม่ว่าทั้งหมดหรือบางส่วน ซึ่งข้อมูลคอมพิวเตอร์ของผู้อื่นโดยมิชอบ ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ`,
    "liable": {
      "imprisonment": ["<=", 5 * 365],
      "fine": ["<=", 1 * 100000],
    }
  },
  {
    "id": 10,
    "category": 1,
    "offense": `
- **การกระทำที่เป็นการหลอกลวงลูกค้า**: การสร้างเว็บไซต์ขายสินค้าผ่านออนไลน์ที่หลอกลวงผู้บริโภค เช่น การโฆษณาขายสินค้าที่ไม่มีอยู่จริง หรือหลอกให้ลูกค้าโอนเงินก่อนแล้วไม่จัดส่งสินค้าหรือบริการตามที่ได้โฆษณา
- **การนำข้อมูลเท็จเข้าสู่ระบบเพื่อกระทำธุรกรรมหลอกลวง**: การแอบอ้างข้อมูลหรือรายละเอียดของสินค้าในเว็บไซต์ e-commerce เช่น การแสดงข้อมูลที่บิดเบือนเกี่ยวกับคุณสมบัติของสินค้าหรือการรีวิวปลอมเพื่อดึงดูดลูกค้าเข้ามาซื้อ
- **การกระทำผิดที่เกี่ยวกับการขโมยข้อมูลส่วนบุคคลจากลูกค้า**: การแฮกหรือดักจับข้อมูลบัตรเครดิตของผู้ใช้ผ่านระบบออนไลน์ เพื่อทำการทุจริตการเงิน เช่น การทำธุรกรรมที่ไม่ได้รับอนุญาต
- **การละเมิดลิขสิทธิ์ในธุรกิจออนไลน์**: การจำหน่ายหรือเผยแพร่ซอฟต์แวร์ เพลง หนัง หรือเนื้อหาที่ละเมิดลิขสิทธิ์ โดยไม่มีการอนุญาตจากเจ้าของลิขสิทธิ์ผ่านเว็บไซต์ หรือแอปพลิเคชันที่ใช้ในการค้าออนไลน์
- **การใช้ระบบคอมพิวเตอร์ในการทำให้ระบบออนไลน์หยุดทำงาน (DDoS Attack)**: การโจมตีเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ด้วยการส่งคำขอจำนวนมาก (Distributed Denial-of-Service: DDoS) เพื่อทำให้เว็บไซต์ไม่สามารถให้บริการได้ ซึ่งอาจทำให้ผู้ประกอบการสูญเสียรายได้หรือเสียชื่อเสียง
    `,
    "text": `ผู้ใดกระทำด้วยประการใดโดยมิชอบ เพื่อให้การทำงานของระบบคอมพิวเตอร์ของผู้อื่นถูกระงับ ชะลอ ขัดขวาง หรือรบกวนจนไม่สามารถทำงานตามปกติได้ ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ`,
    "liable": {
      "imprisonment": ["<=", 5 * 365],
      "fine": ["<=", 1 * 100000],
    }
  },
  {
    "id": 11,
    "category": 1,
    "offense": `
- **การโฆษณาสินค้าหรือบริการที่เป็นเท็จ**: การขายสินค้าที่ไม่มีอยู่จริง หรือการโฆษณาสินค้าในเว็บไซต์หรือแอปพลิเคชันออนไลน์ โดยระบุว่าเป็นสินค้าคุณภาพสูง แต่จริงๆ แล้วสินค้านั้นมีคุณภาพต่ำหรือไม่มีอยู่ในสต็อก
- **การเผยแพร่รีวิวสินค้าเท็จเพื่อหลอกลวงผู้บริโภค**: การสร้างบัญชีปลอมเพื่อโพสต์รีวิวที่ดีให้กับสินค้าของตนเองในเว็บไซต์อีคอมเมิร์ซ หรือการซื้อรีวิวจากบุคคลภายนอกที่ไม่ใช่ผู้ใช้สินค้าจริง
- **การใช้ข้อมูลเท็จในการตลาดออนไลน์**: การบิดเบือนข้อมูลเกี่ยวกับราคาหรือการจัดโปรโมชั่นในเว็บไซต์ เพื่อหลอกลวงผู้บริโภคให้เชื่อว่าเป็นข้อเสนอที่ดีกว่าความเป็นจริง เช่น การกล่าวว่า "สินค้าลดราคา 50%" แต่เมื่อผู้ซื้อคลิกซื้อกลับพบว่าไม่มีการลดราคา หรือสินค้าไม่สามารถซื้อได้ในราคาดังกล่าว
- **การสร้างเว็บไซต์ปลอมเพื่อหลอกลวงการโอนเงิน**: การสร้างเว็บไซต์ที่ดูเหมือนเป็นเว็บไซต์ของร้านค้าออนไลน์ที่มีชื่อเสียง เพื่อหลอกให้ผู้ใช้กรอกข้อมูลบัตรเครดิตหรือโอนเงินไปยังบัญชีของผู้กระทำผิด
        `,
    "text": `ผู้ใดส่งข้อมูลคอมพิวเตอร์หรือจดหมายอิเล็กทรอนิกส์แก่บุคคลอื่น โดยปกปิดหรือปลอมแปลงแหล่งที่มาของการส่งข้อมูลดังกล่าว อันเป็นการรบกวนการใช้ระบบคอมพิวเตอร์ของบุคคลอื่นโดยปกติสุข ต้องระวางโทษปรับไม่เกินหนึ่งแสนบาท`,
    "liable": {
      "fine": ["<=", 1 * 100000],
    }
  },
  {
    "id": 12,
    "category": 1,
    "offense": `
- **การโฆษณาสินค้าหรือบริการที่หลอกลวง**: การโฆษณาขายสินค้าที่ไม่มีอยู่จริงผ่านเว็บไซต์หรือแอปพลิเคชัน เช่น การขายโทรศัพท์มือถือที่แสดงภาพสินค้าหรูหราแต่ไม่สามารถจัดส่งสินค้าจริงให้กับลูกค้าได้ โดยที่ลูกค้าหลงเชื่อและทำการโอนเงินไปแล้ว
- **การสร้างเว็บไซต์ปลอมเพื่อหลอกลวงการชำระเงิน**: การสร้างเว็บไซต์ปลอมที่เหมือนกับเว็บไซต์จริงของธนาคารหรือเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ เพื่อหลอกให้ผู้ใช้ป้อนข้อมูลบัตรเครดิตหรือข้อมูลส่วนบุคคลของตน
- **การขายสินค้าออนไลน์ที่ไม่ตรงตามคำโฆษณา**: การขายเสื้อผ้าออนไลน์ที่ถูกโฆษณาว่ามีคุณภาพดีและราคาถูก แต่เมื่อส่งสินค้าจริงๆ กลับพบว่าเป็นสินค้าที่ไม่มีคุณภาพและไม่ตรงกับคำโฆษณา
- **การกระทำผิดเกี่ยวกับการขายสินค้าออนไลน์ที่ไม่เป็นไปตามเงื่อนไข**: การรับเงินจากลูกค้าสำหรับการจองห้องพักในโรงแรมออนไลน์ แต่เมื่อถึงเวลาเดินทางกลับพบว่าไม่มีห้องพักหรือการจองที่ถูกต้อง`,
    "text": `ถ้าการกระทำความผิดตามมาตรา [9](/#section9) หรือมาตรา [10](/#section10)
1. ก่อให้เกิดความเสียหายแก่ประชาชน ไม่ว่าความเสียหายนั้นจะเกิดขึ้นในทันทีหรือในภายหลังและไม่ว่าจะเกิดขึ้น พร้อมกันหรือไม่ ต้องระวางโทษจำคุกไม่เกินสิบปี และปรับไม่เกินสองแสนบาท
2. เป็นการกระทำโดยประการที่น่าจะเกิดความเสียหายต่อข้อมูลคอมพิวเตอร์หรือระบบ คอมพิวเตอร์ที่เกี่ยวกับการรักษาความมั่นคงปลอดภัยของประเทศ ความปลอดภัยสาธารณะ ความมั่นคงในทางเศรษฐกิจของประเทศ หรือการบริการสาธารณะ หรือเป็นการกระทำต่อข้อมูลคอมพิวเตอร์หรือระบบคอมพิวเตอร์ที่มีไว้เพื่อ ประโยชน์สาธารณะ ต้องระวางโทษจำคุกตั้งแต่สามปีถึงสิบห้าปี และปรับตั้งแต่หกหมื่นบาทถึงสามแสนบาท
ถ้าการกระทำความผิดตาม [2](/#section2) เป็นเหตุให้ผู้อื่นถึงแก่ความตาย ต้องระวางโทษจำคุกตั้งแต่สิบปีถึงยี่สิบปี`,
    "liable": [
      {
        "imprisonment": ["<=", 10 * 365],
        "fine": ["<=", 2 * 100000],
      },
      {
        "imprisonment": [3 * 365, "-", 5 * 365],
        "fine": [6 * 10000, "-", 3 * 100000],
      },
      {
        "imprisonment": [10 * 365, "-", 20 * 365],
      }
    ]
  },
  {
    "id": 13,
    "category": 1,
    "offense": `
- **การทำธุรกรรมออนไลน์ที่ไม่ตรงกับข้อเท็จจริง**: การขายสินค้าผ่านเว็บไซต์ที่ไม่ได้มีสินค้าดังกล่าวจริง หรือไม่สามารถจัดส่งสินค้าให้กับลูกค้าได้ตามที่โฆษณาไว้ในเว็บไซต์
- **การทำธุรกรรมที่หลอกลวงในพาณิชย์อิเล็กทรอนิกส์**: การหลอกลวงลูกค้าผ่านการโฆษณาโปรแกรมหรือแอปพลิเคชันที่อ้างว่าเป็นเครื่องมือช่วยในการทำธุรกรรมการเงิน หรือการลงทุนที่ไม่มีอยู่จริง
- **การหลอกลวงด้วยการสร้างเว็บไซต์ปลอม**: การสร้างเว็บไซต์ปลอมที่มีลักษณะเหมือนกับเว็บไซต์ของธนาคารหรือร้านค้าปลีกออนไลน์ชื่อดัง โดยมีวัตถุประสงค์เพื่อขโมยข้อมูลส่วนบุคคลหรือข้อมูลทางการเงินจากผู้ใช้
- **การใช้โปรแกรมแอบแฝงเพื่อเข้าถึงข้อมูลทางการเงิน**: การสร้างและกระจายซอฟต์แวร์ที่สามารถติดตามข้อมูลการทำธุรกรรมของผู้ใช้ เช่น รหัสบัตรเครดิต หรือข้อมูลการโอนเงินผ่านช่องทางออนไลน์
    `,
    "text": `ผู้ใดจำหน่ายหรือเผยแพร่ชุดคำสั่งที่จัดทำขึ้นโดยเฉพาะเพื่อนำไปใช้เป็น เครื่องมือในการกระทำความผิดตามมาตรา [5](/#section5) มาตรา [6](/#section6) มาตรา [7](/#section7) มาตรา [8](/#section8) มาตรา [9](/#section9) มาตรา [10](/#section10) หรือมาตรา [11](/#section11) ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ`,
    "liable": {
      "imprisonment": ["<=", 1 * 365],
      "fine": ["<=", 2 * 10000],
    }
  },
  {
    "id": 14,
    "category": 1,
    "offense": `
- **การนำข้อมูลเท็จเข้าสู่ระบบคอมพิวเตอร์เพื่อหลอกลวงผู้บริโภค**: การขายสินค้าออนไลน์ที่ไม่มีอยู่จริง หรือการโฆษณาสินค้าโดยใช้ข้อมูลที่ไม่เป็นจริงเพื่อดึงดูดให้ผู้บริโภคหลงเชื่อและทำการโอนเงิน
- **การเผยแพร่ข้อมูลเท็จในเว็บไซต์พาณิชย์อิเล็กทรอนิกส์**: การโพสต์รีวิวสินค้าที่เป็นเท็จหรือปลอมแปลงเพื่อทำให้สินค้าดูดีเกินความเป็นจริง
- **การเผยแพร่ข้อมูลที่ผิดกฎหมายหรือกระทำความผิดทางธุรกิจออนไลน์**: หรือการจัดจำหน่ายซอฟต์แวร์ที่ไม่ได้รับอนุญาต
    `,
    "text": `ผู้ใดกระทำความผิดที่ระบุไว้ดังต่อไปนี้ ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ
1. นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ปลอมไม่ว่าทั้งหมดหรือบาง ส่วน หรือข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน
2. นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหายต่อความมั่นคงของประเทศหรือก่อให้เกิดความ ตื่นตระหนกแก่ประชาชน
3. นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใด ๆ อันเป็นความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักรหรือความผิดเกี่ยวกับการ ก่อการร้ายตามประมวลกฎหมายอาญา
4. นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใด ๆ ที่มีลักษณะอันลามก และข้อมูลคอมพิวเตอร์นั้นประชาชนทั่วไปอาจเข้าถึงได้
5. เผยแพร่หรือส่งต่อซึ่งข้อมูลคอมพิวเตอร์โดยรู้อยู่แล้วว่าเป็นข้อมูลคอมพิวเตอร์ตาม [(1)](/#section1) [(2)](/#section2) [(3)](/#section3) หรือ [(4)](/#section4)`,
    "cases": [
      'gtUD8ph-oYI'
    ],
    "liable": {
      "imprisonment": ["<=", 5 * 365],
      "fine": ["<=", 1 * 100000],
    }
  },
  {
    "id": 15,
    "category": 1,
    "offense": `
- **การใช้ชื่อปลอมในการสมัครบัญชีผู้ใช้**: เช่น การเปิดบัญชีในเว็บไซต์ซื้อขายออนไลน์โดยใช้ข้อมูลปลอมเพื่อหลอกลวงผู้ขายและทำการสั่งซื้อสินค้าหรือบริการโดยไม่ต้องชำระเงินจริง
- **การทำธุรกรรมการเงินโดยใช้ข้อมูลบัตรเครดิตปลอม**: เช่น การใช้ข้อมูลบัตรเครดิตที่ขโมยมา หรือสร้างข้อมูลปลอมเพื่อทำการชำระเงินซื้อสินค้าออนไลน์ที่ไม่ได้รับอนุญาตจากเจ้าของบัตร
- **การหลอกลวงในการสร้างรีวิวสินค้าหรือบริการ**: เช่น การใช้ชื่อปลอมในการสร้างรีวิวหรือคะแนนสินค้าในเว็บไซต์พาณิชย์อิเล็กทรอนิกส์เพื่อหลอกลวงผู้บริโภคให้ซื้อสินค้าหรือบริการที่ไม่ดี
    `,
    "text": `ผู้ให้บริการผู้ใดจงใจสนับสนุนหรือยินยอมให้มีการกระทำความผิดตามมาตรา [14](/#section14) ในระบบคอมพิวเตอร์ที่อยู่ในความควบคุมของตน ต้องระวางโทษเช่นเดียวกับผู้กระทำความผิดตามมาตรา [14](/#section14)`,
    "liable": {
      "imprisonment": ["<=", 5 * 365],
      "fine": ["<=", 1 * 100000],
    }
  },
  {
    "id": 16,
    "category": 1,
    "offense": `
- **การกระทำที่ทำให้ระบบคอมพิวเตอร์ไม่สามารถทำงานได้ตามปกติ**: การโจมตีเว็บไซต์ของธุรกิจออนไลน์ด้วยการใช้ การโจมตีแบบ DDoS (Distributed Denial of Service) ซึ่งทำให้เว็บไซต์พาณิชย์อิเล็กทรอนิกส์หรือแอปพลิเคชันออนไลน์ไม่สามารถให้บริการได้ตามปกติ ทำให้เกิดความเสียหายทั้งด้านธุรกิจและชื่อเสียง
- **การใช้ข้อมูลที่ได้มาจากการกระทำผิดเพื่อทำการค้าขาย**: การใช้ข้อมูลที่ได้มาจากการแฮกเว็บไซต์พาณิชย์อิเล็กทรอนิกส์ เช่น การขโมยข้อมูลส่วนตัวหรือข้อมูลบัตรเครดิตของลูกค้า แล้วนำข้อมูลเหล่านั้นไปทำธุรกรรมหรือขายในตลาดมืด
- **การเผยแพร่ข้อมูลเท็จที่ทำให้เกิดความเสียหายทางการค้า**: การปล่อยข่าวปลอมผ่านเว็บไซต์หรือแพลตฟอร์มออนไลน์ที่มีผลกระทบต่อธุรกิจ เช่น การโฆษณาสินค้าหรือบริการที่ไม่มีอยู่จริง หรือการบิดเบือนข้อมูลเกี่ยวกับบริษัทหรือสินค้าเพื่อทำลายชื่อเสียง
- **การหลอกลวงในธุรกรรมออนไลน์**: การสร้างเว็บไซต์ปลอมที่ดูเหมือนร้านค้าออนไลน์จริง ๆ เพื่อหลอกลวงผู้บริโภคให้ทำการโอนเงินไปยังบัญชีของผู้กระทำผิดโดยที่ไม่ได้รับสินค้าหรือบริการที่สัญญาไว้
    `,
    "text": `ผู้ใดนำเข้าสู่ระบบคอมพิวเตอร์ที่ประชาชนทั่วไปอาจเข้าถึงได้ ซึ่งข้อมูลคอมพิวเตอร์ที่ปรากฏเป็นภาพของผู้อื่น และภาพนั้นเป็นภาพที่เกิดจากการสร้างขึ้น ตัดต่อ เติมหรือดัดแปลงด้วยวิธีการทางอิเล็กทรอนิกส์หรือวิธีการอื่นใด ทั้งนี้ โดยประการที่น่าจะทำให้ผู้อื่นนั้นเสียชื่อเสียง ถูกดูหมิ่น ถูกเกลียดชัง หรือได้รับความอับอาย ต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ
ถ้าการกระทำตามวรรคหนึ่ง เป็นการนำเข้าข้อมูลคอมพิวเตอร์โดยสุจริต ผู้กระทำไม่มีความผิด
ความ ผิดตามวรรคหนึ่งเป็นความผิดอันยอมความได้ ถ้าผู้เสียหายในความผิดตามวรรคหนึ่งตายเสียก่อนร้องทุกข์ ให้บิดา มารดา คู่สมรส หรือบุตรของผู้เสียหายร้องทุกข์ได้ และให้ถือว่าเป็นผู้เสียหาย`,
    "cases": [
      "MoKF8bpDZzQ"
    ],
    "liable": {
      "imprisonment": ["<=", 3 * 365],
      "fine": ["<=", 6 * 10000],
    }
  },
  {
    "id": 17,
    "category": 1,
    "text": `ผู้ใดกระทำความผิดตามพระราชบัญญัตินี้นอกราชอาณาจักรและ
1. ผู้กระทำความผิดนั้นเป็นคนไทย และรัฐบาลแห่งประเทศที่ความผิดได้เกิดขึ้นหรือผู้เสียหายได้ร้องขอให้ลงโทษ หรือ
2. ผู้กระทำความผิดนั้นเป็นคนต่างด้าว และรัฐบาลไทยหรือคนไทยเป็นผู้เสียหายและผู้เสียหายได้ร้องขอให้ลงโทษ จะต้องรับโทษภายในราชอาณาจักร`
  },
  {
    "id": 18,
    "category": 2,
    "text": `ภายใต้บังคับมาตรา [19](/#section19) เพื่อประโยชน์ในการสืบสวนและสอบสวน ในกรณีที่มีเหตุอันควรเชื่อได้ว่ามีการกระทำความผิดตามพระราชบัญญัตินี้ ให้พนักงานเจ้าหน้าที่มีอำนาจอย่างหนึ่งอย่างใด ดังต่อไปนี้ เฉพาะที่จำเป็นเพื่อประโยชน์ในการใช้เป็นหลักฐานเกี่ยวกับการกระทำความผิด และหาตัวผู้กระทำความผิด
1. มีหนังสือสอบถามหรือเรียกบุคคลที่เกี่ยวข้องกับการกระทำความผิดตามพระราช บัญญัตินี้มาเพื่อให้ถ้อยคำ ส่งคำชี้แจงเป็นหนังสือ หรือส่งเอกสาร ข้อมูล หรือหลักฐานอื่นใดที่อยู่ในรูปแบบที่สามารถเข้าใจได้
2. เรียกข้อมูลจราจรทางคอมพิวเตอร์จากผู้ให้บริการเกี่ยวกับการติดต่อสื่อสาร ผ่านระบบคอมพิวเตอร์หรือจากบุคคลอื่นที่เกี่ยวข้อง
3. สั่งให้ผู้ให้บริการส่งมอบข้อมูลเกี่ยวกับผู้ใช้บริการที่ต้องเก็บตามมาตรา [26](/#section26) หรือที่อยู่ในความครอบครองหรือควบคุมของผู้ให้บริการให้แก่พนักงานเจ้า หน้าที่
4. ทำสำเนาข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ จากระบบคอมพิวเตอร์ที่มีเหตุอันควรเชื่อได้ว่ามีการกระทำความผิดตามพระราช บัญญัตินี้ ในกรณีที่ระบบคอมพิวเตอร์นั้นยังมิได้อยู่ในความครอบครองของพนักงานเจ้า หน้าที่
5. สั่งให้บุคคลซึ่งครอบครองหรือควบคุมข้อมูลคอมพิวเตอร์ หรืออุปกรณ์ที่ใช้เก็บข้อมูลคอมพิวเตอร์ ส่งมอบข้อมูลคอมพิวเตอร์ หรืออุปกรณ์ดังกล่าวให้แก่พนักงานเจ้าหน้าที่
6. ตรวจสอบหรือเข้าถึงระบบคอมพิวเตอร์ ข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ หรืออุปกรณ์ที่ใช้เก็บข้อมูลคอมพิวเตอร์ของบุคคลใด อันเป็นหลักฐานหรืออาจใช้เป็นหลักฐานเกี่ยวกับการกระทำความผิด หรือเพื่อสืบสวนหาตัวผู้กระทำความผิดและสั่งให้บุคคลนั้นส่งข้อมูล คอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ ที่เกี่ยวข้องเท่าที่จำเป็นให้ด้วยก็ได้
7. ถอดรหัสลับของข้อมูลคอมพิวเตอร์ของบุคคลใด หรือสั่งให้บุคคลที่เกี่ยวข้องกับการเข้ารหัสลับของข้อมูลคอมพิวเตอร์ ทำการถอดรหัสลับ หรือให้ความร่วมมือกับพนักงานเจ้าหน้าที่ในการถอดรหัสลับดังกล่าว
8. ยึดหรืออายัดระบบคอมพิวเตอร์เท่าที่จำเป็นเฉพาะเพื่อประโยชน์ในการทราบราย ละเอียดแห่งความผิดและผู้กระทำความผิดตามพระราชบัญญัตินี้`
  },
  {
    "id": 19,
    "category": 2,
    "text": `การใช้อำนาจของพนักงานเจ้าหน้าที่ตามมาตรา [18](/#section18) [(4)](/#section4) [(5)](/#section5) [(6)](/#section6) [(7)](/#section7) และ [(8)](/#section8) ให้พนักงานเจ้าหน้าที่ยื่นคำร้องต่อศาลที่มีเขตอำนาจเพื่อมีคำสั่งอนุญาตให้ พนักงานเจ้าหน้าที่ดำเนินการตามคำร้อง ทั้งนี้ คำร้องต้องระบุเหตุอันควรเชื่อได้ว่าบุคคลใดกระทำหรือกำลังจะกระทำการอย่าง หนึ่งอย่างใดอันเป็นความผิดตามพระราชบัญญัตินี้ เหตุที่ต้องใช้อำนาจ ลักษณะของการกระทำความผิด รายละเอียดเกี่ยวกับอุปกรณ์ที่ใช้ในการกระทำความผิดและผู้กระทำความผิด เท่าที่สามารถจะระบุได้ประกอบคำร้องด้วย ในการพิจารณาคำร้องให้ศาลพิจารณาคำร้องดังกล่าวโดยเร็ว
เมื่อศาลมีคำสั่งอนุญาตแล้ว ก่อนดำเนินการตามคำสั่งของศาล ให้พนักงาน
เจ้า หน้าที่ส่งสำเนาบันทึกเหตุอันควรเชื่อที่ทำให้ต้องใช้อำนาจตามมาตรา [18](/#section18) [(4)](/#section4) [(5)](/#section5) [(6)](/#section6) [(7)](/#section7) และ [(8)](/#section8) มอบให้เจ้าของหรือผู้ครอบครองระบบคอมพิวเตอร์นั้นไว้เป็นหลักฐาน แต่ถ้าไม่มีเจ้าของหรือผู้ครอบครองเครื่องคอมพิวเตอร์อยู่ ณ ที่นั้น ให้พนักงานเจ้าหน้าที่ส่งมอบสำเนาบันทึกนั้นให้แก่เจ้าของหรือผู้ครอบครอง ดังกล่าวในทันทีที่กระทำได้
ให้พนักงานเจ้าหน้าที่ผู้เป็นหัวหน้าในการดำเนินการตามมาตรา [18](/#section18) [(4)](/#section4) [(5)](/#section5) [(6)](/#section6) [(7)](/#section7) และ [(8)](/#section8) ส่งสำเนาบันทึกรายละเอียดการดำเนินการและเหตุผลแห่งการดำเนินการ ให้ศาลที่มีเขตอำนาจภายในสี่สิบแปดชั่วโมงนับแต่เวลาลงมือดำเนินการ เพื่อเป็นหลักฐาน
การทำสำเนาข้อมูลคอมพิวเตอร์ตามมาตรา [18](/#section18) [(4)](/#section4) ให้กระทำได้เฉพาะเมื่อมีเหตุอันควรเชื่อได้ว่ามีการกระทำความผิดตามพระราช บัญญัตินี้ และต้องไม่เป็นอุปสรรคในการดำเนินกิจการของเจ้าของหรือผู้ครอบครองข้อมูล คอมพิวเตอร์นั้นเกินความจำเป็น
การยึดหรืออายัดตามมาตรา [18](/#section18) [(8)](/#section8) นอกจากจะต้องส่งมอบสำเนาหนังสือแสดงการยึดหรืออายัดมอบให้เจ้าของหรือผู้ ครอบครองระบบคอมพิวเตอร์นั้นไว้เป็นหลักฐานแล้ว พนักงานเจ้าหน้าที่จะสั่งยึดหรืออายัดไว้เกินสามสิบวันมิได้ ในกรณีจำเป็นที่ต้องยึดหรืออายัด ไว้นานกว่านั้น ให้ยื่นคำร้องต่อศาลที่มีเขตอำนาจเพื่อขอขยายเวลายึดหรืออายัดได้ แต่ศาลจะอนุญาตให้ขยายเวลาครั้งเดียวหรือหลายครั้งรวมกันได้อีกไม่เกินหกสิบ วัน เมื่อหมดความจำเป็นที่จะยึดหรืออายัดหรือครบกำหนดเวลาดังกล่าวแล้ว พนักงานเจ้าหน้าที่ต้องส่งคืนระบบคอมพิวเตอร์ ที่ยึดหรือถอนการอายัดโดยพลัน
หนังสือแสดงการยึดหรืออายัดตามวรรคห้าให้เป็นไปตามที่กำหนดในกฎกระทรวง`
  },  {
    "id": 25,
    "category": 2,
    "text": `ข้อมูล ข้อมูลคอมพิวเตอร์ หรือข้อมูลจราจรทางคอมพิวเตอร์ ที่พนักงานเจ้าหน้าที่ได้มาตามพระราชบัญญัตินี้ ให้อ้างและรับฟังเป็นพยานหลักฐานตามบทบัญญัติแห่งประมวลกฎหมายวิธีพิจารณา ความอาญาหรือกฎหมายอื่นอันว่าด้วยการสืบพยานได้ แต่ต้องเป็นชนิดที่มิได้เกิดขึ้นจากการจูงใจ มีคำมั่นสัญญา ขู่เข็ญ หลอกลวง หรือโดยมิชอบประการอื่น`
  },
  {
    "id": 20,
    "category": 2,
    "text": `ในกรณีที่การกระทำความผิดตามพระราชบัญญัตินี้เป็นการทำให้แพร่หลายซึ่ง ข้อมูลคอมพิวเตอร์ที่อาจกระทบกระเทือนต่อความมั่นคงแห่งราชอาณาจักรตามที่ กำหนดไว้ในภาคสอง ลักษณะ 1 หรือลักษณะ 1/1 แห่งประมวลกฎหมายอาญา หรือที่มีลักษณะขัดต่อ ความสงบเรียบร้อยหรือศีลธรรมอันดีของประชาชน พนักงานเจ้าหน้าที่โดยได้รับความเห็นชอบจากรัฐมนตรีอาจยื่นคำร้องพร้อมแสดง พยานหลักฐานต่อศาลที่มีเขตอำนาจขอให้มีคำสั่งระงับ การทำให้แพร่หลายซึ่งข้อมูลคอมพิวเตอร์นั้นได้
ในกรณีที่ศาลมีคำสั่งให้ ระงับการทำให้แพร่หลายซึ่งข้อมูลคอมพิวเตอร์ตามวรรคหนึ่ง ให้พนักงานเจ้าหน้าที่ทำการระงับการทำให้แพร่หลายนั้นเอง หรือสั่งให้ผู้ให้บริการระงับการทำให้แพร่หลายซึ่งข้อมูลคอมพิวเตอร์นั้นก็ ได้`
  },
  {
    "id": 21,
    "category": 2,
    "text": `ในกรณีที่พนักงานเจ้าหน้าที่พบว่า ข้อมูลคอมพิวเตอร์ใดมีชุดคำสั่ง ไม่พึงประสงค์รวมอยู่ด้วย พนักงานเจ้าหน้าที่อาจยื่นคำร้องต่อศาลที่มีเขตอำนาจเพื่อขอให้มีคำสั่งห้าม จำหน่ายหรือเผยแพร่ หรือสั่งให้เจ้าของหรือผู้ครอบครองข้อมูลคอมพิวเตอร์นั้นระงับการใช้ ทำลาย หรือแก้ไขข้อมูลคอมพิวเตอร์นั้นได้ หรือจะกำหนดเงื่อนไขในการใช้ มีไว้ในครอบครอง หรือเผยแพร่ชุดคำสั่งไม่พึงประสงค์ดังกล่าวก็ได้
ชุดคำสั่งไม่พึงประสงค์ตามวรรคหนึ่งหมายถึงชุดคำสั่งที่มีผลทำให้ข้อมูล คอมพิวเตอร์ หรือระบบคอมพิวเตอร์หรือชุดคำสั่งอื่นเกิดความเสียหาย ถูกทำลาย ถูกแก้ไข เปลี่ยนแปลงหรือเพิ่มเติม ขัดข้อง หรือปฏิบัติงานไม่ตรงตามคำสั่งที่กำหนดไว้ หรือโดยประการอื่นตามที่กำหนดในกฎกระทรวง ทั้งนี้ เว้นแต่เป็นชุดคำสั่งที่มุ่งหมายในการป้องกันหรือแก้ไขชุดคำสั่งดังกล่าว ข้างต้น ตามที่รัฐมนตรีประกาศในราชกิจจานุเบกษา`
  },
  {
    "id": 22,
    "category": 2,
    "text": `ห้ามมิให้พนักงานเจ้าหน้าที่เปิดเผยหรือส่งมอบข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ หรือข้อมูลของผู้ใช้บริการ ที่ได้มาตามมาตรา [18](/#section18) ให้แก่บุคคลใด
ความในวรรคหนึ่งมิให้ใช้บังคับกับการกระทำเพื่อประโยชน์ ในการดำเนินคดีกับผู้กระทำความผิดตามพระราชบัญญัตินี้ หรือเพื่อประโยชน์ในการดำเนินคดีกับพนักงานเจ้าหน้าที่เกี่ยวกับการใช้อำนาจ หน้าที่โดยมิชอบ หรือเป็นการกระทำตามคำสั่งหรือที่ได้รับอนุญาตจากศาล
พนักงานเจ้าหน้าที่ผู้ใดฝ่าฝืนวรรคหนึ่งต้องระวางโทษจำคุกไม่เกินสามปี หรือปรับไม่เกินหกหมื่นบาท หรือทั้งจำทั้งปรับ`
  },
  {
    "id": 23,
    "category": 2,
    "offense": `
- **การหลอกลวงผ่านเว็บไซต์ขายสินค้า**: บุคคลหนึ่งสร้างเว็บไซต์ที่ดูเหมือนเป็นเว็บไซต์ขายสินค้าออนไลน์ที่มีชื่อเสียง โดยใช้ข้อมูลที่ไม่เป็นจริง เช่น โฆษณาขายสินค้าที่ไม่มีจริง หรือมีการแสดงราคาที่ผิดปกติ เช่น สินค้าราคาแพงแต่ขายในราคาถูกเพื่อดึงดูดลูกค้าให้โอนเงินก่อนที่จะไม่จัดส่งสินค้าให้
- **การใช้ข้อมูลที่ไม่ถูกต้องในการโฆษณาหรือประชาสัมพันธ์**:  การเผยแพร่ข้อมูลที่บิดเบือนหรือผิดปกติในเชิงพาณิชย์ เช่น โฆษณาสินค้าหรือบริการโดยใช้ข้อมูลที่ไม่เป็นความจริง เช่น การบอกว่าผลิตภัณฑ์สามารถรักษาโรคหรือให้ผลลัพธ์ที่ไม่ได้รับการรับรองจากหน่วยงานที่เกี่ยวข้อง
- **การปลอมแปลงข้อมูลเพื่อการค้า**: การปลอมแปลงหรือแก้ไขข้อมูลในระบบคอมพิวเตอร์ของธุรกิจเพื่อหลอกลวงลูกค้า เช่น การแสดงข้อมูลสินค้า หรือบริการที่ไม่ถูกต้องเพื่อให้ผู้บริโภคหลงเชื่อและตัดสินใจทำธุรกรรม
- **การหลอกลวงลูกค้าผ่านอีเมลหรือการส่งข้อความ**: กการส่งอีเมลหรือข้อความปลอม (phishing) โดยอ้างว่าเป็นบริษัทหรือผู้ให้บริการที่มีชื่อเสียง เพื่อหลอกลวงให้ลูกค้ากรอกข้อมูลส่วนตัว เช่น รหัสบัตรเครดิต หรือรหัสผ่าน เพื่อทำการขโมยข้อมูลหรือเงินจากผู้บริโภค
    `,
    "text": `พนักงานเจ้าหน้าที่ผู้ใดกระทำโดยประมาทเป็นเหตุให้ผู้อื่นล่วงรู้ข้อมูล คอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ หรือข้อมูลของผู้ใช้บริการ ที่ได้มาตามมาตรา [18](/#section18) ต้องระวางโทษจำคุกไม่เกินหนึ่งปี หรือปรับไม่เกินสองหมื่นบาท หรือทั้งจำทั้งปรับ`,
    "liable": {
      "imprisonment": ["<=", 3 * 365],
      "fine": ["<=", 6 * 10000],
    }
  },
  {
    "id": 24,
    "category": 2,
    "offense": `
- **การหลอกลวงหรือฉ้อโกงทางออนไลน์**: การสร้างเว็บไซต์ปลอมเพื่อหลอกลวงลูกค้าให้โอนเงินเพื่อซื้อสินค้าหรือบริการที่ไม่มีอยู่จริง เช่น การขายสินค้าผ่านอินเทอร์เน็ตโดยไม่มีสินค้าหรือบริการจริง หรือการใช้โปรแกรมหลอกลวงเพื่อให้ผู้ใช้กรอกข้อมูลส่วนตัวหรือข้อมูลบัตรเครดิตที่ทำให้ผู้กระทำผิดสามารถนำไปใช้ในทางที่ผิด
- **การหลอกลวงข้อมูลในเชิงพาณิชย์**: การโฆษณาขายสินค้าหรือบริการโดยการให้ข้อมูลที่เป็นเท็จ เช่น การบอกว่าเป็นสินค้าที่มีคุณภาพสูง แต่จริง ๆ แล้วเป็นสินค้าปลอม หรือมีคุณภาพต่ำกว่า
- **การขายสินค้าละเมิดลิขสิทธิ์ออนไลน์**: การเปิดเว็บไซต์หรือแพลตฟอร์มออนไลน์ที่ขายซอฟต์แวร์ เพลง ภาพยนตร์ หรือสินค้าอื่น ๆ ที่ละเมิดลิขสิทธิ์ เช่น การขายโปรแกรมซอฟต์แวร์ที่ไม่มีใบอนุญาต หรือการขายหนังที่ไม่ได้รับการอนุมัติจากเจ้าของลิขสิทธิ์
- **การใช้ระบบคอมพิวเตอร์เพื่อขโมยข้อมูลทางธุรกรรม**: การเข้าถึงข้อมูลการทำธุรกรรมทางออนไลน์ของลูกค้าโดยไม่ได้รับอนุญาต เช่น การขโมยข้อมูลการชำระเงินหรือข้อมูลบัตรเครดิตจากเว็บไซต์พาณิชย์อิเล็กทรอนิกส์
    `,
    "text": `ผู้ใดล่วงรู้ข้อมูลคอมพิวเตอร์ ข้อมูลจราจรทางคอมพิวเตอร์ หรือข้อมูลของผู้ใช้บริการ ที่พนักงานเจ้าหน้าที่ได้มาตามมาตรา [18](/#section18) และเปิดเผยข้อมูลนั้นต่อ ผู้หนึ่งผู้ใด ต้องระวางโทษจำคุกไม่เกินสองปี หรือปรับไม่เกินสี่หมื่นบาท หรือทั้งจำทั้งปรับ`,
    "liable": {
      "imprisonment": ["<=", 2 * 365],
      "fine": ["<=", 4 * 10000],
    }
  },
  {
    "id": 26,
    "category": 2,
    "offense": `
- **การโฆษณาสินค้าหรือบริการที่เป็นเท็จหรือหลอกลวง:** การโฆษณาขายสินค้าผ่านเว็บไซต์หรือแพลตฟอร์มออนไลน์โดยใช้ข้อมูลที่เป็นเท็จ เช่น การขายสินค้าปลอม หรือการอ้างว่าเป็นสินค้าคุณภาพดีแต่ไม่ตรงตามที่โฆษณา เช่น โฆษณาขายเครื่องมืออิเล็กทรอนิกส์ที่ไม่สามารถใช้งานได้ตามที่กล่าวอ้าง
- **การหลอกลวงผู้บริโภคด้วยการให้ข้อมูลเท็จเกี่ยวกับราคา หรือคุณสมบัติของสินค้า:** การโพสต์โฆษณาขายสินค้าออนไลน์ในราคาที่ต่ำเกินจริง เช่น การขายโทรศัพท์มือถือในราคาถูกเกินจริง แต่เมื่อผู้ซื้อโอนเงินไปแล้วพบว่าไม่สามารถติดต่อผู้ขายได้ หรือสินค้าคือสินค้าปลอม
- **การใช้ข้อมูลเท็จในการทำธุรกรรมพาณิชย์อิเล็กทรอนิกส์:** การใช้ข้อมูลปลอมในการทำธุรกรรมออนไลน์ เช่น การใช้ข้อมูลบัตรเครดิตปลอมในการชำระเงินสำหรับการซื้อสินค้าออนไลน์
- **การปลอมแปลงหรือปล่อยข้อมูลเท็จในเว็บไซต์พาณิชย์อิเล็กทรอนิกส์:** การปลอมแปลงหรือเผยแพร่ข้อมูลเท็จในเว็บไซต์พาณิชย์อิเล็กทรอนิกส์เพื่อหลอกลวงผู้บริโภค เช่น การสร้างเว็บไซต์ที่ดูเหมือนเป็นเว็บไซต์ของแบรนด์ดังแต่จริงๆ แล้วเป็นเว็บไซต์ปลอมเพื่อหลอกลวงให้ลูกค้าโอนเงิน
`,
    "text": `ผู้ให้บริการต้องเก็บรักษาข้อมูลจราจรทางคอมพิวเตอร์ไว้ไม่น้อยกว่า เก้าสิบวันนับแต่วันที่ข้อมูลนั้นเข้าสู่ระบบคอมพิวเตอร์ แต่ในกรณีจำเป็นพนักงานเจ้าหน้าที่จะสั่ง ให้ผู้ให้บริการผู้ใดเก็บรักษาข้อมูลจราจรทางคอมพิวเตอร์ไว้เกินเก้าสิบวัน แต่ไม่เกินหนึ่งปีเป็นกรณีพิเศษเฉพาะรายและเฉพาะคราวก็ได้
&nbsp;  
ผู้ให้บริการจะต้องเก็บรักษาข้อมูลของผู้ใช้บริการเท่าที่จำเป็นเพื่อให้ สามารถระบุตัวผู้ใช้บริการนับตั้งแต่เริ่มใช้บริการและต้องเก็บรักษาไว้เป็น เวลาไม่น้อยกว่าเก้าสิบวันนับตั้งแต่การใช้บริการสิ้นสุดลง
&nbsp;  
ความในวรรคหนึ่งจะใช้กับผู้ให้บริการประเภทใด อย่างไร และเมื่อใด ให้เป็นไปตามที่รัฐมนตรีประกาศในราชกิจจานุเบกษา
ผู้ให้บริการผู้ใดไม่ปฏิบัติตามมาตรานี้ ต้องระวางโทษปรับไม่เกินห้าแสนบาท`,
    "liable": {
      "fine": ["<=", 5 * 100000],
    }
  },
  {
    "id": 27,
    "category": 2,
    "offense": `
- **การหลอกลวงทางการค้าออนไลน์:**  มีผู้ประกอบการธุรกิจออนไลน์ที่ใช้เว็บไซต์หรือแอปพลิเคชันเพื่อโฆษณาสินค้า (เช่น โทรศัพท์มือถือหรืออุปกรณ์อิเล็กทรอนิกส์) โดยการให้ข้อมูลเท็จหรือไม่ครบถ้วนเกี่ยวกับสินค้าที่ขาย เช่น การบอกว่าสินค้ามีคุณสมบัติพิเศษที่ไม่มีจริง หรือการบ่งบอกว่ามีโปรโมชั่นลดราคาพิเศษที่ไม่เป็นจริง
- **การเผยแพร่ข้อมูลปลอมเพื่อหลอกลวงลูกค้า:** บุคคลที่ใช้ระบบออนไลน์ เช่น เว็บไซต์ หรือโซเชียลมีเดีย เพื่อเผยแพร่ข้อมูลปลอมเกี่ยวกับบริการ หรือสินค้า เช่น การประกาศว่าได้รับการรับรองจากหน่วยงานหรือองค์กรที่น่าเชื่อถือ ซึ่งแท้จริงแล้วไม่มีการรับรองดังกล่าว
  `,
    "text": `ผู้ใดไม่ปฏิบัติตามคำสั่งของศาลหรือพนักงานเจ้าหน้าที่ที่สั่งตามมาตรา [18](/#section18) หรือมาตรา [20](/#section20) หรือไม่ปฏิบัติตามคำสั่งของศาลตามมาตรา [21](/#section21) ต้องระวางโทษปรับ ไม่เกินสองแสนบาท และปรับเป็นรายวันอีกไม่เกินวันละห้าพันบาทจนกว่าจะปฏิบัติให้ถูกต้อง`,
    "liable": {
      "fine": ["<=", 2 * 100000],
      "fineUntil": ["<=", 5000],
    }
  },
  {
    "id": 28,
    "category": 2,
    "text": `การแต่งตั้งพนักงานเจ้าหน้าที่ตามพระราชบัญญัตินี้ ให้รัฐมนตรีแต่งตั้งจากผู้มีความรู้และความชำนาญเกี่ยวกับระบบคอมพิวเตอร์ และมีคุณสมบัติตามที่รัฐมนตรีกำหนด`
  },
  {
    "id": 29,
    "category": 2,
    "text": `ในการปฏิบัติหน้าที่ตามพระราชบัญญัตินี้ ให้พนักงานเจ้าหน้าที่ เป็นพนักงานฝ่ายปกครองหรือตำรวจชั้นผู้ใหญ่ตามประมวลกฎหมายวิธีพิจารณาความ อาญา มีอำนาจรับคำร้องทุกข์หรือรับคำกล่าวโทษ และมีอำนาจในการสืบสวนสอบสวนเฉพาะความผิดตามพระราชบัญญัตินี้
ในการจับ ควบคุม ค้น การทำสำนวนสอบสวนและดำเนินคดีผู้กระทำความผิดตามพระราชบัญญัตินี้ บรรดาที่เป็นอำนาจของพนักงานฝ่ายปกครองหรือตำรวจชั้นผู้ใหญ่ หรือพนักงานสอบสวนตามประมวลกฎหมายวิธีพิจารณาความอาญา ให้พนักงานเจ้าหน้าที่ประสานงาน กับพนักงานสอบสวนผู้รับผิดชอบเพื่อดำเนินการตามอำนาจหน้าที่ต่อไป&nbsp;  
ให้นายกรัฐมนตรีในฐานะผู้กำกับดูแลสำนักงานตำรวจแห่งชาติและรัฐมนตรี&nbsp;  
มีอำนาจร่วมกันกำหนดระเบียบเกี่ยวกับแนวทางและวิธีปฏิบัติในการดำเนินการตามวรรคสอง`
  },
  {
    "id": 30,
    "category": 2,
    "text": `ในการปฏิบัติหน้าที่ พนักงานเจ้าหน้าที่ต้องแสดงบัตรประจำตัว ต่อบุคคลซึ่งเกี่ยวข้อง
บัตรประจำตัวของพนักงานเจ้าหน้าที่ให้เป็นไปตามแบบที่รัฐมนตรีประกาศ ในราชกิจจานุเบกษา`
  },
].map(section => ({
    ...section,
    liablePoint: calculateLiablePoint(section.liable as Liable),
    category: categories.find(category => category.id === section.category) as Category
})) as Section[]